#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
Warning: Deprecated attribute

  on modules/ServicePrincipal/output.tf line 23, in output "service_principal_application_id":
  23:   value       = azuread_service_principal.main.application_id

The attribute "application_id" is deprecated. Refer to the provider
documentation for details.
Success! The configuration is valid, but there were some validation warnings
as shown above.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[1mazurerm_resource_group.demo_rg: Refreshing state... [id=/subscriptions/245140cf-eeea-4def-9e7f-f42e9d0e701a/resourceGroups/demo_rg][0m
[0m[1mazurerm_resource_group.aks_demo_rg: Refreshing state... [id=/subscriptions/245140cf-eeea-4def-9e7f-f42e9d0e701a/resourceGroups/aks-demo-rg][0m
[0m[1mmodule.ServicePrincipal.data.azuread_client_config.current: Reading...[0m[0m
[0m[1mazurerm_container_registry.acr: Refreshing state... [id=/subscriptions/245140cf-eeea-4def-9e7f-f42e9d0e701a/resourceGroups/demo_rg/providers/Microsoft.ContainerRegistry/registries/acrdev0101984][0m
[0m[1mmodule.ServicePrincipal.data.azuread_client_config.current: Read complete after 0s [id=433c9b93-54ed-4d8f-bada-40aa45f229c1-4f5acb54-5cb9-4a8a-b9f5-cc8f9b3864cf-e47b7e57-e1b4-4cce-9215-80e9539ebcdd][0m
[0m[1mmodule.ServicePrincipal.azuread_application.main: Refreshing state... [id=/applications/985021d4-8c9c-4066-a62c-0a82a3145254][0m
[0m[1mmodule.ServicePrincipal.azuread_service_principal.main: Refreshing state... [id=e47b7e57-e1b4-4cce-9215-80e9539ebcdd][0m
[0m[1mmodule.ServicePrincipal.azuread_service_principal_password.main: Refreshing state... [id=e47b7e57-e1b4-4cce-9215-80e9539ebcdd/password/cc720aec-1959-40b5-a12f-437f40727693][0m
[0m[1mazurerm_role_assignment.rolespn: Refreshing state... [id=/subscriptions/245140cf-eeea-4def-9e7f-f42e9d0e701a/providers/Microsoft.Authorization/roleAssignments/49b3c457-1c9f-c6a7-6c80-5abeacdbc02a][0m
[0m[1mmodule.keyvault.azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/245140cf-eeea-4def-9e7f-f42e9d0e701a/resourceGroups/demo_rg/providers/Microsoft.KeyVault/vaults/dev-kv-0101984][0m
[0m[1mazurerm_role_assignment.example: Refreshing state... [id=/subscriptions/245140cf-eeea-4def-9e7f-f42e9d0e701a/resourceGroups/demo_rg/providers/Microsoft.ContainerRegistry/registries/acrdev0101984/providers/Microsoft.Authorization/roleAssignments/4dc98d01-4d79-5455-77f6-2e8354ebddc6][0m
[0m[1mazurerm_role_assignment.key_vault_admin: Refreshing state... [id=/subscriptions/245140cf-eeea-4def-9e7f-f42e9d0e701a/resourceGroups/demo_rg/providers/Microsoft.KeyVault/vaults/dev-kv-0101984/providers/Microsoft.Authorization/roleAssignments/d423cb72-9da9-79d0-6d6f-06b46acba93e][0m
[0m[1mazurerm_key_vault_secret.example: Refreshing state... [id=https://dev-kv-0101984.vault.azure.net/secrets/e47b7e57-e1b4-4cce-9215-80e9539ebcdd/35ebb72f688040909c651a517107f737][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.ServicePrincipal.azuread_application.main[0m will be updated in-place
[0m  [33m~[0m[0m resource "azuread_application" "main" {
        id                             = "/applications/985021d4-8c9c-4066-a62c-0a82a3145254"
      [33m~[0m[0m owners                         = [
          [31m-[0m[0m "c687c2cb-bbb3-4775-b6a2-d85fe6aaa69f",
          [32m+[0m[0m "e47b7e57-e1b4-4cce-9215-80e9539ebcdd",
        ]
        tags                           = []
        [90m# (25 unchanged attributes hidden)[0m[0m

        [90m# (6 unchanged blocks hidden)[0m[0m
    }

[1m  # module.ServicePrincipal.azuread_service_principal.main[0m will be updated in-place
[0m  [33m~[0m[0m resource "azuread_service_principal" "main" {
        id                            = "e47b7e57-e1b4-4cce-9215-80e9539ebcdd"
      [33m~[0m[0m owners                        = [
          [31m-[0m[0m "c687c2cb-bbb3-4775-b6a2-d85fe6aaa69f",
          [32m+[0m[0m "e47b7e57-e1b4-4cce-9215-80e9539ebcdd",
        ]
        tags                          = []
        [90m# (24 unchanged attributes hidden)[0m[0m

        [90m# (3 unchanged blocks hidden)[0m[0m
    }

[1m  # module.aks.data.azurerm_kubernetes_service_versions.current[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_kubernetes_service_versions" "current" {
      [32m+[0m[0m default_version = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m include_preview = false
      [32m+[0m[0m latest_version  = (known after apply)
      [32m+[0m[0m location        = "West Europe"
      [32m+[0m[0m versions        = (known after apply)
    }

[1m  # module.aks.azurerm_kubernetes_cluster.aks-cluster[0m will be created
[0m  [32m+[0m[0m resource "azurerm_kubernetes_cluster" "aks-cluster" {
      [32m+[0m[0m api_server_authorized_ip_ranges     = (known after apply)
      [32m+[0m[0m current_kubernetes_version          = (known after apply)
      [32m+[0m[0m dns_prefix                          = "aks-demo-rg-cluster"
      [32m+[0m[0m fqdn                                = (known after apply)
      [32m+[0m[0m http_application_routing_zone_name  = (known after apply)
      [32m+[0m[0m id                                  = (known after apply)
      [32m+[0m[0m image_cleaner_enabled               = false
      [32m+[0m[0m image_cleaner_interval_hours        = 48
      [32m+[0m[0m kube_admin_config                   = (sensitive value)
      [32m+[0m[0m kube_admin_config_raw               = (sensitive value)
      [32m+[0m[0m kube_config                         = (sensitive value)
      [32m+[0m[0m kube_config_raw                     = (sensitive value)
      [32m+[0m[0m kubernetes_version                  = (known after apply)
      [32m+[0m[0m location                            = "westeurope"
      [32m+[0m[0m name                                = "demo-aks-cluster"
      [32m+[0m[0m node_resource_group                 = "aks-demo-rg-nrg"
      [32m+[0m[0m node_resource_group_id              = (known after apply)
      [32m+[0m[0m oidc_issuer_url                     = (known after apply)
      [32m+[0m[0m portal_fqdn                         = (known after apply)
      [32m+[0m[0m private_cluster_enabled             = false
      [32m+[0m[0m private_cluster_public_fqdn_enabled = false
      [32m+[0m[0m private_dns_zone_id                 = (known after apply)
      [32m+[0m[0m private_fqdn                        = (known after apply)
      [32m+[0m[0m public_network_access_enabled       = true
      [32m+[0m[0m resource_group_name                 = "aks-demo-rg"
      [32m+[0m[0m role_based_access_control_enabled   = true
      [32m+[0m[0m run_command_enabled                 = true
      [32m+[0m[0m sku_tier                            = "Free"
      [32m+[0m[0m support_plan                        = "KubernetesOfficial"
      [32m+[0m[0m workload_identity_enabled           = false

      [32m+[0m[0m default_node_pool {
          [32m+[0m[0m enable_auto_scaling  = true
          [32m+[0m[0m kubelet_disk_type    = (known after apply)
          [32m+[0m[0m max_count            = 3
          [32m+[0m[0m max_pods             = (known after apply)
          [32m+[0m[0m min_count            = 1
          [32m+[0m[0m name                 = "defaultpool"
          [32m+[0m[0m node_count           = (known after apply)
          [32m+[0m[0m node_labels          = {
              [32m+[0m[0m "environment"   = "prod"
              [32m+[0m[0m "nodepool-type" = "system"
              [32m+[0m[0m "nodepoolos"    = "linux"
            }
          [32m+[0m[0m orchestrator_version = (known after apply)
          [32m+[0m[0m os_disk_size_gb      = 30
          [32m+[0m[0m os_disk_type         = "Managed"
          [32m+[0m[0m os_sku               = (known after apply)
          [32m+[0m[0m scale_down_mode      = "Delete"
          [32m+[0m[0m tags                 = {
              [32m+[0m[0m "environment"   = "prod"
              [32m+[0m[0m "nodepool-type" = "system"
              [32m+[0m[0m "nodepoolos"    = "linux"
            }
          [32m+[0m[0m type                 = "VirtualMachineScaleSets"
          [32m+[0m[0m ultra_ssd_enabled    = false
          [32m+[0m[0m vm_size              = "Standard_DS2_v2"
          [32m+[0m[0m workload_runtime     = (known after apply)
          [32m+[0m[0m zones                = [
              [32m+[0m[0m "2",
            ]
        }

      [32m+[0m[0m network_profile {
          [32m+[0m[0m dns_service_ip          = (known after apply)
          [32m+[0m[0m docker_bridge_cidr      = (known after apply)
          [32m+[0m[0m ip_versions             = (known after apply)
          [32m+[0m[0m load_balancer_sku       = "standard"
          [32m+[0m[0m network_mode            = (known after apply)
          [32m+[0m[0m network_plugin          = "azure"
          [32m+[0m[0m network_policy          = (known after apply)
          [32m+[0m[0m outbound_ip_address_ids = (known after apply)
          [32m+[0m[0m outbound_ip_prefix_ids  = (known after apply)
          [32m+[0m[0m outbound_type           = "loadBalancer"
          [32m+[0m[0m pod_cidr                = (known after apply)
          [32m+[0m[0m pod_cidrs               = (known after apply)
          [32m+[0m[0m service_cidr            = (known after apply)
          [32m+[0m[0m service_cidrs           = (known after apply)
        }

      [32m+[0m[0m service_principal {
          [32m+[0m[0m client_id     = "4f5acb54-5cb9-4a8a-b9f5-cc8f9b3864cf"
          [32m+[0m[0m client_secret = (sensitive value)
        }
    }

[1m  # module.keyvault.data.azurerm_client_config.current[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_client_config" "current" {
      [32m+[0m[0m client_id       = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m object_id       = (known after apply)
      [32m+[0m[0m subscription_id = (known after apply)
      [32m+[0m[0m tenant_id       = (known after apply)
    }

[1m  # module.keyvault.azurerm_key_vault.kv[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/245140cf-eeea-4def-9e7f-f42e9d0e701a/resourceGroups/demo_rg/providers/Microsoft.KeyVault/vaults/dev-kv-0101984"
        name                            = "dev-kv-0101984"
        tags                            = {}
      [33m~[0m[0m tenant_id                       = "433c9b93-54ed-4d8f-bada-40aa45f229c1" -> (known after apply)
        [90m# (12 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 3 to change, 0 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mDeprecated attribute[0m
[33m│[0m [0m
[33m│[0m [0m[0m  on modules/ServicePrincipal/output.tf line 23, in output "service_principal_application_id":
[33m│[0m [0m  23:   value       = azuread_service_principal.main[4m.application_id[0m[0m
[33m│[0m [0m
[33m│[0m [0mThe attribute "application_id" is deprecated. Refer to the provider
[33m│[0m [0mdocumentation for details.
[33m│[0m [0m
[33m│[0m [0m(and one more similar warning elsewhere)
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @mr-goce, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*